applications/test/reactions/Time-Splitting/constant/thermo.Gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermo.Gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

O2
{
    specie
    {
        molWeight       31.9988;
    }
    thermodynamics
    {
        Cp              916.641;
        Hf              0;
    }
    transport
    {
        mu              1.846e-05;
        Pr              0.71;
    }
}



N2
{
    specie
    {
        molWeight       28.0134;
    }
    thermodynamics
    {
        Cp              1037.92;
        Hf              0;
    }
    transport
    {
        mu              1.846e-05;
        Pr              0.71;
    }
}

CO2
{
    specie
    {
        molWeight       44.01;
    }
    thermodynamics
    {
        Cp              847.085;
        Hf              0;
    }
    transport
    {
        mu              1.846e-05;
        Pr              0.71;
    }
}


// ************************************************************************* //
